INTERVAL = 1
RETRY_TIMES = 5

WEEK_MAP = ["一", "二", "三", "四", "五", "六", "日"]

AREAS = ["蒙德", "璃月", "稻妻", "须弥", "枫丹", "纳塔", "至冬", "坎瑞亚"]
# fmt: off
# 章节顺序、国家（区域）名是从《足迹》 PV 中取的
DOMAINS = [
    "忘却之峡",      # 蒙德精通秘境
    "太山府",       # 璃月精通秘境
    "菫色之庭",      # 稻妻精通秘境
    "昏识塔",       # 须弥精通秘境
    "苍白的遗荣",    # 枫丹精通秘境
    "",            # 纳塔精通秘境
    "",            # 至东精通秘境
    "",            # 坎瑞亚精通秘境
    "塞西莉亚苗圃",  # 蒙德炼武秘境
    "震雷连山密宫",  # 璃月炼武秘境
    "砂流之庭",     # 稻妻炼武秘境
    "有顶塔",       # 须弥炼武秘境
    "深潮的余响",    # 枫丹炼武秘境
    "",           # 纳塔炼武秘境
    "",           # 至东炼武秘境
    "",           # 坎瑞亚炼武秘境
]
# fmt: on
DOMAIN_AREA_MAP = dict(zip(DOMAINS, AREAS * 2))
