POOL_2000 = [
    {
        "five": ["晨曦朝露"],
        "four": ["沧浪利刃", "安眠暖夜", "焦甜麦香"],
        "name": "祥应吉星",
        "from": "2026-01-14 06:00:00",
        "to": "2026-02-24 14:59:59",
    },
    {
        "five": ["霜庭雪翎"],
        "four": ["暖冬欢歌", "荒远山裔", "疗愈心意"],
        "name": "雪阵霜庭",
        "from": "2025-12-03 06:00:00",
        "to": "2026-01-13 14:59:59",
    },
    {
        "five": ["烛影狂欢夜"],
        "four": ["幻音废墟", "狂热斗士", "幽秘森域"],
        "name": "幻夜游烛",
        "from": "2025-10-22 06:00:00",
        "to": "2025-12-02 14:59:59",
    },
]
